In [15]:
from bs4 import BeautifulSoup
import requests
import pandas as pd

In [7]:
url = "https://www.koreabaseball.com/History/Crowd/GraphDaily.aspx" # url
result = requests.get(url) #url request 받기
bs_obj = BeautifulSoup(result.text, "html.parser") # html 읽기

class명이 tData인 table tag를 찾아 tdata에 할당<br>
그 안에 tbody의 데이터를 series에 할당

In [24]:
tdata = bs_obj.find("table", {"class":"tData"})
series = tdata.find("tbody") 
kbdata_spec = series.text

tadata 안의 tr태그를 모두 찾아 rows에 할당

In [11]:
rows = tdata.find_all('tr')

res라는 빈공간을 생성하고 <br>
반복문을 이용하여 tr 안의 td tag를 찾아 td에 할당하고 <br>
row 변수에 반복문을 이용하여 strip()함수를 이용하여 td tag안의 tr 태그 안의 내용의 문자열의 양 끝에 있는 공백과 \n을 제거 <br>
그리고 row 변수를 append 함수를 이용하여 df 결합

In [12]:
res = []
for tr in rows:
    td = tr.find_all('td')
    row = [tr.text.strip() for tr in td if tr.text.strip()]
    if row:
        res.append(row)

데이터 프레임을 생성하여 컬럼 설정해주고 <br>
맨 첫 번째 줄은 드랍해준다

In [18]:
df_tdata = pd.DataFrame(res, columns=['date','day','h_team','v_team','place','number'])
df_tdata = df_tdata.drop(0)

그리고 number의 요소에 ,를 제거

In [21]:
df_tdata['number'] = df_tdata['number'].str.replace(',','')

In [23]:
df_tdata.head()

         date day h_team v_team place number
1  2019/03/23   토     두산     한화    잠실  25000
2  2019/03/23   토     SK     KT    문학  21909
3  2019/03/23   토    KIA     LG    광주  20500
4  2019/03/23   토     NC     삼성    창원  22112
5  2019/03/23   토     롯데     키움    사직  24500

teddy lee 님께서 도와주셨습니다. <br>